package basebodyig

//go:generate go run gen/define/main.go

const (
	// BodYig分音符 区分一个个加密单元
	BodYig分音符  = `་`
	BodYig分节符3 = `༐`
	BodYig分节符2 = `༏`
	BodYig分节符1 = `།`
	// BodYig分节符 一个加密实体的结束, 依次为 三个字节全满 满两个 满一个
	BodYig分节符 = BodYig分节符3 + BodYig分节符2 + BodYig分节符1
	// BodYig魔术符 标记此为一个 basebodyig 加密算法
	BodYig魔术符 = `༼༒༽`
	// BodYig空字符 表示没有该符号
	BodYig空字符 = `◌`
	// BodYig区分符 用以区分 前加字+基字 和 基字+后加字
	BodYig区分符 = `འ`
)

const (
	// BodYig单符基字 38 包括但不限于三十个基字
	BodYig单符基字 = `༉ཀཁགངཅཆཇཉཊཋཌཎཏཐདནཔཕབམཙཚཛཝཞཟཡརལཤཥསཧཨཪཫཬ`
)

const (
	// BodYig单符附标 3位 可用在基字后, 加 ཀ 辅助显示, 仅挑选显示效果好的 (在上部的)
	BodYig单符附标 = `ཀིཀེཀཻཀོཀཽཀྀཀྂ`
	// BodYig单符下字 包括但不限于下加字
	BodYig单符下字 = `ྐྑྒྒྷྔྕྖྗྙྚྛྜྜྷྞྟྠྡྡྷྣྤྥྦྦྷྨྩྪྫྫྷྭྮྯྰྱྲླྴྵྶྷྸྐྵྺྻྼ`
)

const (
	// BodYig双符合字 342 可被正确拼合的所有双符合字
	BodYig双符合字 = `ཀྐཀྑཀྟཀྠཀྣཀྤཀྦཀྩཀྭཀྱཀྲཀླཀྴཀྵཀྶཁྭཁྱཁྲཁླཁྴཁྷགྒགྒྷགྟགྠགྡགྡྷགྣགྥགྦགྦྷགྨགྫགྭགྱགྲགླགྷགྷྣགྷྭགྷྱགྷྲགྷླངྐངྑངྒངྒྷངྠངྫངྲངླངྴངྷཅྪཅྭཅྱཇྙཇྱཉྕཉྟཉྩཉྪཉྫཉྭཉྲཉླཊྐཊྑཊྚཊྭཊྱཊྲཊླཊྴཊྷཋྲཋླཌྒཌྚཌྜཌྜྷཌྦཌྲཌླཌྷཌྷྲཌྷླཎྚཎྛཎྜཎྜྷཎྞཎྡཎྩཎྫཎྱཎྲཎླཏྐཏྒཏྜཏྟཏྠཏྣཏྤཏྥཏྦཏྦྷཏྨཏྭཏྱཏྲཏླཏྶཏྐྵཐྱཐྲཐླདྐདྒདྒྷདྡདྡྷདྣདྦདྦྷདྨདྭདྱདྲདླདྷདྷྨདྷྭདྷྱདྷྲདྷླནྜནྟནྠནྡནྡྷནྣནྤནྦནྨནྩནྫནྭནྱནྲནླནྶནྷཔྟཔྠཔྡྷཔྣཔྤཔྥཔྦཔྭཔྱཔྲཔླཔྶཔྷཕྱཕྲཕླབྟབྠབྡབྡྷབྣབྦབྦྷབྫབྱབྲབླབྶབྷབྷྭབྷྱབྷྲབྷླམྐམྠམྡམྣམྤམྥམྦམྦྷམྨམྭམྱམྲམླཙྞཙྩཙྪཙྭཙྱཙྲཙླཚྭཚྲཚླཛྙཛྟཛྣཛྫཛྭཛྱཛྲཛླཛྷཛྷྲཛྷླཝྲཝླཞྭཟྭཟླཡྱཡྲཡླརྐརྒརྒྷརྔརྗརྙརྞརྟརྠརྡརྡྷརྣརྤརྦརྦྷརྨརྩརྫརྫྷརྭརྱརྲརླརྴརྵརྷརྻརྼལྐལྒལྔལྕལྗལྟལྡལྤལྥལྦལྦྷལྨལྫལྭལྱལྲལླལྷཤྕཤྟཤྠཤྣཤྤཤྨཤྩཤྭཤྱཤྲཤླཤྴཤྷཥྐཥྚཥྛཥྞཥྟཥྠཥྤཥྦཥྨཥྩཥྭཥྱཥྲཥླསྐསྑསྒསྔསྙསྚསྟསྠསྡསྣསྤསྥསྦསྨསྩསྭསྱསྲསླསྶསྷཧྞཧྟཧྣཧྤཧྥཧྨཧྭཧྱཧྲཧླཨྱཨྲཨླཀྵྞཀྵྨཀྵྭཀྵྱཀྵྲཀྵླ`
	// BodYig三符合字 177 可被正确拼合的所有三符合字
	BodYig三符合字 = `ཀྐྭཀྐྲཀྟྭཀྟྱཀྟྲཀྤྲཀྱླཀྴྞཀྵྞཀྵྨཀྵྭཀྵྱཀྵྲཀྵླགྒྷགྠྱགྡྲགྡྷགྦྷགྫྙགྲྭགྲྱགྷྣགྷྭགྷྱགྷྲགྷླངྒྷཊྴྲཊྷྱཌྜྷཌྷྲཌྷླཎྜྱཎྜྷཎྞྱཎྡྱཎྡྲཏྐྲཏྐྵཏྟྭཏྟྱཏྟྲཏྤྲཏྦྱཏྦླཏྦྷཏྨྱཏྲྱཏྲྻཏྶྛཏྶྣཏྶྱཏྶྲདྐྲདྒྲདྒྷདྡྱདྡྲདྡྷདྡྷྭདྡྷྱདྡྷྲདྦྱདྦྲདྦྷདྲྭདྷྨདྷྭདྷྱདྷྲདྷླདྷྨྨནྟྱནྟྲནྡྭནྡྱནྡྲནྡྷནྡྷྱནྷྲཔྟྱཔྭྱཔྶྲཕྱྭབྟྱབྡྷབྡྷྱབྦྱབྦྷབྦྷྲབྷྭབྷྱབྷྲབྷླམྡྲམྤྱམྤྲམྦྱམྦྲམྦླམྦྷམྨྲཙྪྱཙྪྲཛྫྭཛྷྲཛྷླརྐྐརྐྱརྒྒརྒྭརྒྱརྒྲརྒྷརྒྷྱརྞྞརྟྟརྟྱརྟྲརྠྱརྡྡརྡྡྷརྡྭརྡྲརྡྷརྡྷྱརྦྦརྦྦྷརྦྲརྦྷརྦྷྱརྨྨརྨྱརྨྲརྩྩརྩྪརྩྭརྫྙརྫྫརྫྭརྫྱརྫྷརྴྭརྵྞརྵྟརྵྱལྦྷལླྱཤྩྪཤྩྱཥྐྲཥྚྱཥྚྲཥྛྱཥྟྲཥྠྱཥྤྲསྐྱསྐྲསྒྱསྒྲསྟྣསྟྭསྟྱསྟྲསྠྲསྣྲསྤྱསྤྲསྥྱསྦྱསྦྲསྨྱསྨྲསྶྭསྷྱ`
	// BodYig四符合字 16 可被正确拼合的所有四符合字
	BodYig四符合字 = `དྡྷྭདྡྷྱདྡྷྲདྷྨྨནྡྷྱབྡྷྱབྦྷྲརྒྷྱརྡྡྲརྡྡྷརྡྷྱརྦྦྷརྦྷྱརྨྨྱརྵྟྲསྟྲྱ`
)

const (
	// BodYig前加字 4位 是藏语前加字的超集
	BodYig前加字 = `◌གདབམའ` + `ཀཁངཅཆཇཉཊཋཌ`
	// BodYig后加字 4位 是藏语后加字的超集
	BodYig后加字 = `◌གངདནབམའརལས` + `ཀཁཅཆཇ`
	// BodYig再后加字 4位 与藏语再后加字`◌དས`不同, 目的是避开所有后加字使语意唯一
	BodYig再后加字 = `◌ཉཊཋཌཎཏཐཔཕཙཚཛཝཞཟ`
	// BodYig基字超集
	BodYig基字超集 = BodYig单符基字 + BodYig双符合字 + BodYig三符合字
)
